In [1]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [4]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived
#inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [5]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [6]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [15]:
inputs.columns[inputs.isna().any()]
inputs.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [16]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [17]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()
model.fit(X_train,y_train)
GaussianNB(priors=None, var_smoothing=1e-09)
model.score(X_test,y_test)

0.7686567164179104

In [18]:
X_test[0:10]

     Pclass        Age     Fare  female
158       3  29.699118   8.6625       0
212       3  22.000000   7.2500       0
710       1  24.000000  49.5042       1
554       3  22.000000   7.7750       1
743       3  24.000000  16.1000       0
634       3   9.000000  27.9000       1
66        2  29.000000  10.5000       1
783       3  29.699118  23.4500       0
122       2  32.500000  30.0708       0
281       3  28.000000   7.8542       0

In [19]:
y_test[0:10]

158    0
212    0
710    1
554    1
743    0
634    0
66     1
783    0
122    0
281    0
Name: Survived, dtype: int64

In [20]:
model.predict(X_test[0:10])

array([0, 0, 1, 1, 0, 1, 1, 0, 0, 0], dtype=int64)

In [21]:
model.predict_proba(X_test[:10])

array([[0.96098705, 0.03901295],
       [0.9560401 , 0.0439599 ],
       [0.03119502, 0.96880498],
       [0.3299939 , 0.6700061 ],
       [0.95718357, 0.04281643],
       [0.2217723 , 0.7782277 ],
       [0.18216706, 0.81783294],
       [0.95860814, 0.04139186],
       [0.8987573 , 0.1012427 ],
       [0.96027782, 0.03972218]])

In [22]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.792     , 0.744     , 0.824     , 0.75806452, 0.76612903])